{
      "Keyboard": " Keyboard may refer to:    ",
      "Mouse": " A mouse, plural mice, is a small rodent characteristically having a pointed snout, small rounded ears, a body-length scaly tail, and a high breeding rate. The best known mouse species is the common house mouse (\"Mus musculus\"). It is also a popular pet. In some places, certain kinds of field mice are locally common. They are known to invade homes for food and shelter.  Species of mice are mostly found in Rodentia, and are present throughout the order. Typical mice are found in the genus Mus.  Mice are typically distinguished from rats by their size. Generally, when someone discovers a smaller muroid rodent, its common name includes the term \"mouse\", while if it is larger, the name includes the term \"rat\". Common terms \"rat\" and \"mouse\" are not taxonomically specific. Scientifically, the term mouse is not confined to members of \"Mus\" for example, but includes such as the deer mouse, \"Peromyscus\".  Domestic mice sold as pets often differ substantially in size from the common house mouse. This is attributable both to breeding and to different conditions in the wild. The best-known strain, the white lab mouse, has more uniform traits that are appropriate to its use in research.  Cats, wild dogs, foxes, birds of prey, snakes and even certain kinds of arthropods have been known to prey heavily upon mice. Nevertheless, because of its remarkable adaptability to almost any environment, the mouse is one of the most successful mammalian genera living on Earth today.  Mice, in certain contexts, can be",
      "Laptop": " A laptop computer (also shortened to just laptop; or called a notebook computer) is a small, portable personal computer (PC) with a \"clamshell\" form factor, typically having a thin LCD or LED computer screen mounted on the inside of the upper lid of the clamshell and an alphanumeric keyboard on the inside of the lower lid. The clamshell is opened up to use the computer. Laptops are folded shut for transportation, and thus are suitable for mobile use. Its name comes from lap, as it was deemed to be placed on a person's lap when being used. Although originally there was a distinction between laptops and notebooks (the former being bigger and heavier than the latter), as of 2014, there is often no longer any difference. Laptops are commonly used in a variety of settings, such as at work, in education, for playing games, Internet surfing, for personal multimedia, and general home computer use.  Laptops combine all the input/output components and capabilities of a desktop computer, including the display screen, small speakers, a keyboard, hard disk drive, optical disc drive, pointing devices (such as a touchpad or trackpad), a processor, and memory into a single unit. Most modern laptops feature integrated webcams and built-in microphones, while many also have touchscreens. Laptops can be powered either from an internal battery or by an external power supply from an AC adapter. Hardware specifications, such as the processor speed and memory capacity, significantly vary between different types, makes, models and price points.  Design elements, form factor",
      "Desktop": " A Desktop traditionally refers to:  Desktop may refer to:   "
}